pg_bench/postgresql_oltp_read_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_read_only --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=8 --table-size=1000000 prepare >> postgresql_oltp_read_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest6'...
Creating table 'sbtest2'...
Creating table 'sbtest1'...
Creating table 'sbtest4'...
Creating table 'sbtest5'...
Creating table 'sbtest3'...
Creating table 'sbtest8'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest6'
Inserting 1000000 records into 'sbtest2'
Inserting 1000000 records into 'sbtest4'
Inserting 1000000 records into 'sbtest3'
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest5'
Inserting 1000000 records into 'sbtest7'
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest2'...
Creating a secondary index on 'sbtest7'...
Creating a secondary index on 'sbtest5'...
Creating a secondary index on 'sbtest6'...
Creating a secondary index on 'sbtest3'...
Creating a secondary index on 'sbtest8'...
Creating a secondary index on 'sbtest4'...
Creating a secondary index on 'sbtest1'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_read_only --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=8 --table-size=1000000 run >> postgresql_oltp_read_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 2546.53 qps: 40752.27 (r/w/o: 35658.41/0.00/5093.86) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 2714.22 qps: 43427.73 (r/w/o: 37999.38/0.00/5428.34) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 2522.51 qps: 40361.32 (r/w/o: 35316.19/0.00/5045.13) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 3266.26 qps: 52256.66 (r/w/o: 45724.24/0.00/6532.42) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 2672.58 qps: 42763.84 (r/w/o: 37418.57/0.00/5345.27) lat (ms,95%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 4017.05 qps: 64270.73 (r/w/o: 56236.74/0.00/8033.99) lat (ms,95%): 3.55 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2483922
        write:                           0
        other:                           354846
        total:                           2838768
    transactions:                        177423 (2955.58 per sec.)
    queries:                             2838768 (47289.29 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0286s
    total number of events:              177423

Latency (ms):
         min:                                    1.13
         avg:                                    2.70
         max:                                  164.75
         95th percentile:                        6.21
         sum:                               479286.22

Threads fairness:
    events (avg/stddev):           22177.8750/118.97
    execution time (avg/stddev):   59.9108/0.01

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=8 --table-size=1000000 cleanup>> postgresql_oltp_read_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...