pg_bench/postgresql_oltp_read_write_threads_8_time_60_tables_8_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_read_write --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=8 --table-size=1000000 prepare >> postgresql_oltp_read_write_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest5'...
Creating table 'sbtest2'...
Creating table 'sbtest8'...
Creating table 'sbtest7'...
Creating table 'sbtest3'...
Creating table 'sbtest6'...
Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest5'
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest2'
Inserting 1000000 records into 'sbtest8'
Inserting 1000000 records into 'sbtest7'
Inserting 1000000 records into 'sbtest3'
Inserting 1000000 records into 'sbtest6'
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest6'...
Creating a secondary index on 'sbtest7'...
Creating a secondary index on 'sbtest8'...
Creating a secondary index on 'sbtest2'...
Creating a secondary index on 'sbtest4'...
Creating a secondary index on 'sbtest3'...
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest5'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_read_write --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=8 --table-size=1000000 run >> postgresql_oltp_read_write_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1727.23 qps: 34555.69 (r/w/o: 24190.58/6909.74/3455.37) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1843.17 qps: 36860.55 (r/w/o: 25802.11/7372.19/3686.24) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 2007.87 qps: 40163.69 (r/w/o: 28115.07/8032.28/4016.34) lat (ms,95%): 6.21 err/s: 0.20 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1873.17 qps: 37459.59 (r/w/o: 26221.14/7492.20/3746.25) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 1628.93 qps: 32586.98 (r/w/o: 22810.47/6518.54/3257.97) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1502.27 qps: 30042.27 (r/w/o: 21030.63/6007.09/3004.55) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1481760
        write:                           423354
        other:                           211682
        total:                           2116796
    transactions:                        105838 (1763.56 per sec.)
    queries:                             2116796 (35271.84 per sec.)
    ignored errors:                      2      (0.03 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0130s
    total number of events:              105838

Latency (ms):
         min:                                    1.44
         avg:                                    4.53
         max:                                  129.51
         95th percentile:                        7.04
         sum:                               479705.15

Threads fairness:
    events (avg/stddev):           13229.7500/300.38
    execution time (avg/stddev):   59.9631/0.00

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=8 --table-size=1000000 cleanup>> postgresql_oltp_read_write_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...